eamars/efr32_bootloader/target/efr32/emdrv/rtcdrv/src/rtcdriver.c
/***************************************************************************//**
 * @file rtcdriver.c
 * @brief RTCDRV timer API implementation.
 * @version 5.1.3
 *******************************************************************************
 * @section License
 * <b>(C) Copyright 2014 Silicon Labs, http://www.silabs.com</b>
 *******************************************************************************
 *
 * This file is licensed under the Silabs License Agreement. See the file
 * "Silabs_License_Agreement.txt" for details. Before using this software for
 * any purpose, you must agree to the terms of that agreement.
 *
 ******************************************************************************/

#include <string.h>

#include "em_device.h"
#include "em_cmu.h"
#include "em_common.h"
#include "em_core.h"

#if defined( RTCC_PRESENT ) && ( RTCC_COUNT == 1 )
#define RTCDRV_USE_RTCC
#else
#define RTCDRV_USE_RTC
#endif

#if defined( RTCDRV_USE_RTCC )
#include "em_rtcc.h"
#else
#include "em_rtc.h"
#endif

#include "rtcdriver.h"
#if defined( EMDRV_RTCDRV_SLEEPDRV_INTEGRATION )
#include "sleep.h"
#endif

/// @cond DO_NOT_INCLUDE_WITH_DOXYGEN

#if     defined( EMDRV_RTCDRV_SLEEPDRV_INTEGRATION ) \
    && !defined( EMDRV_RTCDRV_WALLCLOCK_CONFIG     ) \
    &&  defined( RTCDRV_USE_RTC )
// Do not allow EM3/EM4 energy modes when the RTC is running.
#define EMODE_DYNAMIC
#endif

#if    defined( EMDRV_RTCDRV_SLEEPDRV_INTEGRATION ) \
    && defined( EMDRV_RTCDRV_WALLCLOCK_CONFIG     ) \
    &&  defined( RTCDRV_USE_RTC )
// Always deny EM3/EM4 energy modes when wallclock is enabled.
#define EMODE_NEVER_ALLOW_EM3EM4
#endif

//
// Various #define's to enable use of both RTC and RTCC.
//
#if defined( RTCDRV_USE_RTCC )
#define TIMEDIFF( a, b )              ((a) - (b))
#define RTC_COUNTERGET()              RTCC_CounterGet()
#define RTC_COUNTER_BITS              32
#define RTC_ALL_INTS                  _RTCC_IF_MASK
#define RTC_OF_INT                    RTCC_IF_OF
#define RTC_COMP_INT                  RTCC_IF_CC1
#define RTC_COUNTER_MASK              (_RTCC_CNT_MASK)
#define RTC_MAX_VALUE                 (_RTCC_CNT_MASK)
#define RTC_INTDISABLE( x )           RTCC_IntDisable( x )
#define RTC_INTENABLE( x )            RTCC_IntEnable(  x )
#define RTC_INTCLEAR( x )             RTCC_IntClear(   x )
#define RTC_INTGET()                  RTCC_IntGetEnabled()
#define RTC_COUNTERRESET()            RTCC->CNT = _RTCC_CNT_RESETVALUE
#define RTC_COMPARESET( x )           RTCC_ChannelCCVSet( 1, x )
#define RTC_COMPAREGET()              RTCC_ChannelCCVGet( 1 )
#define NVIC_CLEARPENDINGIRQ()        NVIC_ClearPendingIRQ( RTCC_IRQn )
#define NVIC_DISABLEIRQ()             NVIC_DisableIRQ( RTCC_IRQn )
#define NVIC_ENABLEIRQ()              NVIC_EnableIRQ( RTCC_IRQn )
#define RTC_ONESHOT_TICK_ADJUST       0

#else
// To get the math correct we must have the MSB of the underlying 24bit
// counter in the MSB position of a uint32_t datatype.
#define TIMEDIFF( a, b )              ((( (a)<<8) - ((b)<<8) ) >> 8 )
#define RTC_COUNTERGET()              RTC_CounterGet()
#define RTC_COUNTER_BITS              24
#define RTC_ALL_INTS                  _RTC_IF_MASK
#define RTC_OF_INT                    RTC_IF_OF
#define RTC_COMP_INT                  RTC_IF_COMP0
#define RTC_COUNTER_MASK              (_RTC_CNT_MASK)
#define RTC_MAX_VALUE                 (_RTC_CNT_MASK)
#define RTC_INTDISABLE( x )           RTC_IntDisable( x )
#define RTC_INTENABLE( x )            RTC_IntEnable(  x )
#define RTC_INTCLEAR( x )             RTC_IntClear(   x )
#define RTC_INTGET()                  RTC_IntGetEnabled()
#define RTC_COUNTERRESET()            RTC_CounterReset()
#define RTC_COMPARESET( x )           RTC_CompareSet( 0, (x) & _RTC_COMP0_MASK )
#define RTC_COMPAREGET()              RTC_CompareGet( 0 )
#define NVIC_CLEARPENDINGIRQ()        NVIC_ClearPendingIRQ( RTC_IRQn )
#define NVIC_DISABLEIRQ()             NVIC_DisableIRQ( RTC_IRQn )
#define NVIC_ENABLEIRQ()              NVIC_EnableIRQ( RTC_IRQn )
#define RTC_ONESHOT_TICK_ADJUST       1

#endif

// Maximum number of ticks per overflow period (not the maximum tick value)
#define MAX_RTC_TICK_CNT              (RTC_MAX_VALUE+1UL)
#define RTC_CLOSE_TO_MAX_VALUE        (RTC_MAX_VALUE-100UL)

#if defined(_EFM32_GECKO_FAMILY)
// Assume 32kHz RTC/RTCC clock, cmuClkDiv_2 prescaler, 16 ticks per millisecond
#define RTC_DIVIDER                     ( cmuClkDiv_2 )
#else
// Assume 32kHz RTC/RTCC clock, cmuClkDiv_8 prescaler, 4 ticks per millisecond
#define RTC_DIVIDER                     ( cmuClkDiv_8 )
#endif

#define RTC_CLOCK                       ( 32768U )
#define MSEC_TO_TICKS_DIVIDER           ( 1000U * RTC_DIVIDER )
#define MSEC_TO_TICKS_ROUNDING_FACTOR   ( MSEC_TO_TICKS_DIVIDER / 2 )
#define MSEC_TO_TICKS( ms )             ( ( ( (uint64_t)(ms) * RTC_CLOCK )    \
                                            + MSEC_TO_TICKS_ROUNDING_FACTOR ) \
                                          / MSEC_TO_TICKS_DIVIDER )

#define TICKS_TO_MSEC_ROUNDING_FACTOR   ( RTC_CLOCK / 2 )
#define TICKS_TO_MSEC( ticks )          ( ( ( (uint64_t)(ticks)               \
                                              * RTC_DIVIDER * 1000U )         \
                                            + TICKS_TO_MSEC_ROUNDING_FACTOR ) \
                                          / RTC_CLOCK )

#define TICKS_TO_SEC_ROUNDING_FACTOR    ( RTC_CLOCK / 2 )
#define TICKS_TO_SEC( ticks )           ( ( ( (uint64_t)(ticks)               \
                                              * RTC_DIVIDER )                 \
                                            + TICKS_TO_SEC_ROUNDING_FACTOR )  \
                                          / RTC_CLOCK )
#define TICK_TIME_USEC                  ( 1000000 * RTC_DIVIDER / RTC_CLOCK )

typedef struct Timer
{
  uint64_t            remaining;
  uint64_t            ticks;
  int                 periodicCompensationUsec;
  unsigned int        periodicDriftUsec;
  RTCDRV_Callback_t   callback;
  bool                running;
  bool                doCallback;
  bool                allocated;
  RTCDRV_TimerType_t  timerType;
  void                *user;
} Timer_t;

static Timer_t            timer[ EMDRV_RTCDRV_NUM_TIMERS ];
static uint32_t           lastStart;
static volatile uint32_t  startTimerNestingLevel;
static bool               inTimerIRQ;
static bool               rtcRunning;
static bool               rtcdrvIsInitialized = false;
#if defined( EMODE_DYNAMIC )
static bool               sleepBlocked;
#endif

#if defined( EMDRV_RTCDRV_WALLCLOCK_CONFIG )
static volatile uint32_t  wallClockOverflowCnt;
static uint32_t           wallClockTimeBase;
#endif

