eamars/efr32_bootloader/target/efr32/emdrv/rtcdrv/src/rtcdriver.c
#if defined( RTCDRV_USE_RTC )
static const RTC_Init_TypeDef initRTC =
{
  true,  // Start counting when init completed.
  false, // Disable updating RTC during debug halt.
  false  // Count until max. to wrap around.
};

#elif defined( RTCDRV_USE_RTCC )
static RTCC_Init_TypeDef initRTCC =
{
  true,                 /* Start counting when init completed. */
  false,                /* Disable updating RTC during debug halt. */
  false,                /* Prescaler counts until max. before wrap around. */
  false,                /* Counter counts until max. before wrap around. */
  rtccCntPresc_8,       /* Set RTCC prescaler to 8 */
  rtccCntTickPresc,     /* Count according to prescaler configuration */
#if defined(_RTCC_CTRL_BUMODETSEN_MASK)
  false,                /* Disable storing RTCC counter value in RTCC_CCV2 upon backup mode entry. */
#endif
  false,                /* LFXO fail detection disabled */
  rtccCntModeNormal,    /* Use RTCC in normal mode and not in calender mode */
  false                 /* No leap year correction. */
};

static RTCC_CCChConf_TypeDef initRTCCCompareChannel =
{
  rtccCapComChModeCompare,    /* Use Compare mode */
  rtccCompMatchOutActionPulse,/* Don't care */
  rtccPRSCh0,                 /* PRS not used */
  rtccInEdgeNone,             /* Capture Input not used */
  rtccCompBaseCnt,            /* Compare with Base CNT register */
  0,                          /* Compare mask */
  rtccDayCompareModeMonth     /* Don't care */
};
#endif

// default to LFXO unless specifically directed to use LFRCO
#if defined(EMDRV_RTCDRV_USE_LFRCO)
  #define RTCDRV_OSC cmuSelect_LFRCO
#else
  #define RTCDRV_OSC cmuSelect_LFXO
#endif

static void checkAllTimers( uint32_t timeElapsed );
static void delayTicks( uint32_t ticks );
static void executeTimerCallbacks( void );
static void rescheduleRtc( uint32_t rtcCnt );

/// @endcond

/***************************************************************************//**
 * @brief
 *    Allocate timer.
 *
 * @details
 *    Reserve a timer instance.
 *
 * @param[out] id The id of the reserved timer.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ALL_TIMERS_USED when no timers are available.@n
 *    @ref ECODE_EMDRV_RTCDRV_PARAM_ERROR if an invalid id pointer was supplied.
 ******************************************************************************/
Ecode_t RTCDRV_AllocateTimer( RTCDRV_TimerID_t *id )
{
  CORE_DECLARE_IRQ_STATE;
  int i      = 0;
  Ecode_t retVal = 0;

  CORE_ENTER_ATOMIC();
  // Iterate through the table of the timers until the first available.
  while ( ( i < EMDRV_RTCDRV_NUM_TIMERS ) && ( timer[ i ].allocated ) ) {
    i++;
  }

  // Check if we reached the end of the table.
  if ( i == EMDRV_RTCDRV_NUM_TIMERS ) {
    retVal = ECODE_EMDRV_RTCDRV_ALL_TIMERS_USED;
  } else {
    // Check if a NULL pointer was passed.
    if ( id != NULL ) {
      timer[ i ].allocated = true;
      *id = i;
      retVal = ECODE_EMDRV_RTCDRV_OK;
    } else {
      retVal = ECODE_EMDRV_RTCDRV_PARAM_ERROR;
    }
  }
  CORE_EXIT_ATOMIC();

  return retVal;
}

/***************************************************************************//**
 * @brief
 *    Millisecond delay function.
 *
 * @param[in] ms Milliseconds to stay in the delay function.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK.
 ******************************************************************************/
Ecode_t RTCDRV_Delay( uint32_t ms )
{
  uint64_t totalTicks;

  totalTicks = MSEC_TO_TICKS( ms );

  while ( totalTicks > RTC_CLOSE_TO_MAX_VALUE ) {
    delayTicks( RTC_CLOSE_TO_MAX_VALUE );
    totalTicks -= RTC_CLOSE_TO_MAX_VALUE;
  }
  delayTicks( totalTicks );

  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Free timer.
 *
 * @details
 *    Release a reserved timer.
 *
 * @param[out] id The id of the timer to release.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK on success.@n
 *    @ref ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID if id has an illegal value.
 ******************************************************************************/
Ecode_t RTCDRV_FreeTimer( RTCDRV_TimerID_t id )
{
  // Check if valid timer ID.
  if ( id >= EMDRV_RTCDRV_NUM_TIMERS ) {
    return ECODE_EMDRV_RTCDRV_ILLEGAL_TIMER_ID;
  }

  CORE_ATOMIC_SECTION(
    timer[ id ].running   = false;
    timer[ id ].allocated = false;
  )

  return ECODE_EMDRV_RTCDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    Initialize RTCDRV driver.
 *
 * @details
 *    Will enable all necessary clocks. Initializes internal datastructures
 *    and configures the underlying hardware timer.
 *
 * @return
 *    @ref ECODE_EMDRV_RTCDRV_OK.
 ******************************************************************************/
Ecode_t RTCDRV_Init( void )
{
  if ( rtcdrvIsInitialized == true ) {
    return ECODE_EMDRV_RTCDRV_OK;
  }
  rtcdrvIsInitialized = true;

  // Ensure LE modules are clocked.
  CMU_ClockEnable( cmuClock_CORELE, true );

#if defined( CMU_LFECLKEN0_RTCC )
  // Enable LFECLK in CMU (will also enable oscillator if not enabled).
  CMU_ClockSelectSet( cmuClock_LFE, RTCDRV_OSC );
#else
  // Enable LFACLK in CMU (will also enable oscillator if not enabled).
  CMU_ClockSelectSet( cmuClock_LFA, RTCDRV_OSC );
#endif

#if defined( RTCDRV_USE_RTC )
  // Set clock divider.
  CMU_ClockDivSet( cmuClock_RTC, RTC_DIVIDER );

  // Enable RTC module clock.
  CMU_ClockEnable( cmuClock_RTC, true );

  // Initialize RTC.
  RTC_Init( &initRTC );

#elif defined( RTCDRV_USE_RTCC )
  // Set clock divider.
  initRTCC.presc = (RTCC_CntPresc_TypeDef)CMU_DivToLog2( RTC_DIVIDER );

  // Enable RTCC module clock.
  CMU_ClockEnable( cmuClock_RTCC, true );

  // Initialize RTCC.
  RTCC_Init( &initRTCC );

  // Set up Compare channel.
  RTCC_ChannelInit( 1, &initRTCCCompareChannel );
#endif

  // Disable RTC/RTCC interrupt generation.
  RTC_INTDISABLE( RTC_ALL_INTS );
  RTC_INTCLEAR( RTC_ALL_INTS );

  RTC_COUNTERRESET();

